First, we need to install some libraries

**pip install sqlalchemy pandas ipython-sql**

**pip install jupyterlab_sql**

**jupyter serverextension enable jupyterlab_sql --py --sys-prefix**

**jupyter lab build**

**pip install mysql_kernel**

Once you are done installing the libraries then you need to add below command which adds MySQL kernel to jupyter notebook

#### Add kernel to your jupyter:
**python -m mysql_kernel.install**
As of now the configuration to the jupyter is done.

postgres://localhost:5432/postgres
postgres://username:password@localhost:5432/postgres

mysql://user:password@host:port/db_name

### FOR DDLS
1. %load_ext sql
2. %sql mysql+pymysql://root:root@127.0.0.1:3306/de_interview_questions
3. switch to python kernel
4. use %sql before query execution

### For DMLS
1. select mysql Kernel
2. mysql://root:root@127.0.0.1:3306/de_interview_questions

In [1]:
%load_ext sql
%sql mysql+pymysql://root:root@127.0.0.1:3306/de_interview_questions

In [2]:
mysql://root:root@127.0.0.1:3306/de_interview_questions

In [2]:
show databases;

,Database
0,de_interview_questions
1,demo
2,information_schema
3,mysql
4,performance_schema
5,powerbi
6,sakila
7,sys
8,world

### 1,find the max of col1-col5 for each col1

In [1]:

%%sql 
DROP TABLE IF EXISTS your_table;
CREATE TABLE your_table (
     col1 VARCHAR(10),
     col2 INT,
     col3 INT,
     col4 INT,
     col5 INT);
# -- );
# -- %%sql
# -- INSERT INTO your_table (col1, col2, col3, col4, col5) VALUES ('A', 10, 20, 30, 40);
# -- INSERT INTO your_table (col1, col2, col3, col4, col5) VALUES ('A', 15, 25, 35, 45);
# -- INSERT INTO your_table (col1, col2, col3, col4, col5) VALUES ('B', 5, 15, 25, 35);
# -- INSERT INTO your_table (col1, col2, col3, col4, col5) VALUES ('B', 10, 20, 30, 40);
select col1, max(col2) from (
SELECT col1, col2 FROM sales_pivot
UNION ALL
SELECT col1, col3 FROM sales_pivot
UNION ALL
SELECT col1, col4 FROM sales_pivot
UNION ALL
SELECT col1, col2 FROM sales_pivot) group by 1

In [8]:
select col1, max(col2) from (
SELECT col1, col2 AS col2 FROM your_table
UNION ALL
SELECT col1, col3 AS col2 FROM your_table
UNION ALL
SELECT col1, col4 AS col2 FROM your_table
UNION ALL
SELECT col1, col5 AS col2  FROM your_table) a group by col1;

,col1,max(col2)
0,A,45
1,B,40

In [7]:
SELECT col1, 
       GREATEST(MAX(col2), MAX(col3), MAX(col4), MAX(col5)) AS max_value
FROM your_table
GROUP BY col1;

,col1,max_value
0,A,45
1,B,40

In [5]:
-- # %%sql 
-- # CREATE TABLE skills_table (
-- #     Name VARCHAR(50),
-- #     SkillSet VARCHAR(255)
-- # );

In [6]:
-- # %%sql
-- # INSERT INTO skills_table (Name, SkillSet) VALUES ('ABC', '.Net, Git, C#');
-- # INSERT INTO skills_table (Name, SkillSet) VALUES ('XYZ', 'Wordpress, PHP');
-- # INSERT INTO skills_table (Name, SkillSet) VALUES ('IJK', 'Python, MongoDB, Git');
-- # INSERT INTO skills_table (Name, SkillSet) VALUES ('DEF', 'SSIS, SSAS, Power BI, SQL Server, Data Warehouse');
-- # INSERT INTO skills_table (Name, SkillSet) VALUES ('PQR', 'Azure');

In [7]:
SELECT Name, 
    SUBSTRING_INDEX(SUBSTRING_INDEX(SkillSet, ',', 1), ',', -1) AS Skill1, 
    IF(LENGTH(SkillSet) - LENGTH(REPLACE(SkillSet, ',', '')) >= 1, SUBSTRING_INDEX(SUBSTRING_INDEX(SkillSet, ',', 2), ',', -1), NULL) AS Skill2, 
    IF(LENGTH(SkillSet) - LENGTH(REPLACE(SkillSet, ',', '')) >= 2, SUBSTRING_INDEX(SUBSTRING_INDEX(SkillSet, ',', 3), ',', -1), NULL) AS Skill3, 
    IF(LENGTH(SkillSet) - LENGTH(REPLACE(SkillSet, ',', '')) >= 3, SUBSTRING_INDEX(SUBSTRING_INDEX(SkillSet, ',', 4), ',', -1), NULL) AS Skill4, 
    IF(LENGTH(SkillSet) - LENGTH(REPLACE(SkillSet, ',', '')) >= 4, SUBSTRING_INDEX(SUBSTRING_INDEX(SkillSet, ',', 5), ',', -1), NULL) AS Skill5 
FROM 
    skills_table;

,Name,Skill1,Skill2,Skill3,Skill4,Skill5
0,ABC,.Net,Git,C#,None,None
1,XYZ,Wordpress,PHP,None,None,None
2,IJK,Python,MongoDB,Git,None,None
3,DEF,SSIS,SSAS,Power BI,SQL Server,Data Warehouse
4,PQR,Azure,None,None,None,None

In [8]:
-- %%sql
-- CREATE TABLE TableA (
--     Id INT
-- );
-- %%sql
-- CREATE TABLE TableB (
--     Id INT
-- );

In [9]:
-- %%sql
-- INSERT INTO TableA (Id) VALUES (1);
-- INSERT INTO TableA (Id) VALUES (0);
-- INSERT INTO TableA (Id) VALUES (1);
-- INSERT INTO TableA (Id) VALUES (1);
-- INSERT INTO TableA (Id) VALUES (0);

-- INSERT INTO TableB (Id) VALUES (1);
-- INSERT INTO TableB (Id) VALUES (1);
-- INSERT INTO TableB (Id) VALUES (0);
-- INSERT INTO TableB (Id) VALUES (0);
-- INSERT INTO TableB (Id) VALUES (NULL);

In [11]:
SELECT * FROM Tableb

,Id
0,1.0
1,1.0
2,0.0
3,0.0
4,NaN

In [14]:
SELECT COUNT(*) FROM TABLEA A INNER JOIN TABLEB B ON A.ID = B.ID;

,COUNT(*)
0,10

In [13]:
SELECT *
FROM TableA A
RIGHT JOIN TableB B ON A.Id = B.Id;

,Id,Id
0,1.0,1.0
1,1.0,1.0
2,1.0,1.0
3,1.0,1.0
4,1.0,1.0
5,1.0,1.0
6,0.0,0.0
7,0.0,0.0
8,0.0,0.0
9,0.0,0.0
10,NaN,NaN

In [15]:
SELECT A.Id
FROM TableA A
LEFT JOIN TableB B ON A.Id = B.Id
UNION
SELECT B.Id
FROM TableA A
RIGHT JOIN TableB B ON A.Id = B.Id

,Id
0,1.0
1,0.0
2,NaN

In [ ]:
CREATE TABLE orders (
    order_id INT PRIMARY KEY,
    customer_id INT,
    order_date DATE,
    total_amount DECIMAL(10, 2)
);
INSERT INTO orders (order_id, customer_id, order_date, total_amount) VALUES (1, 101, '2024-01-15', 250.00);
INSERT INTO orders (order_id, customer_id, order_date, total_amount) VALUES (2, 102, '2024-02-20', 150.50);
INSERT INTO orders (order_id, customer_id, order_date, total_amount) VALUES (3, 103, '2024-03-10', 300.75);
INSERT INTO orders (order_id, customer_id, order_date, total_amount) VALUES (4, 101, '2024-04-05', 450.00);
INSERT INTO orders (order_id, customer_id, order_date, total_amount) VALUES (5, 104, '2024-05-25', 120.00);
INSERT INTO orders (order_id, customer_id, order_date, total_amount) VALUES (6, 105, '2024-06-15', 220.00);
INSERT INTO orders (order_id, customer_id, order_date, total_amount) VALUES (7, 102, '2024-07-20', 330.50);
INSERT INTO orders (order_id, customer_id, order_date, total_amount) VALUES (8, 106, '2024-08-30', 410.00);
INSERT INTO orders (order_id, customer_id, order_date, total_amount) VALUES (9, 107, '2024-09-10', 275.25);
INSERT INTO orders (order_id, customer_id, order_date, total_amount) VALUES (10, 108, '2024-10-05', 500.00);

Question 1:
Scenario: You have a table called "orders" with columns "order_id", "customer_id", "order_date", and "total_amount". Write a query to find the customers who have placed an order in the last 30 days, but not in the last 14 days.
2. Calculate the Total Sales Amount for Each Customer
3. Find the Most Recent Order for Each Customer
4. List All Orders with a Total Amount Greater Than a Specific Value
5. Count the Number of Orders Placed by Each Customer

In [26]:
SELECT * FROM ORDERS WHERE ORDER_DATE BETWEEN DATE_SUB(curdate(), INTERVAL 30 DAY) AND DATE_SUB(CURDATE(),interval 14 DAY);

,order_id,customer_id,order_date,total_amount
0,11,109,2024-11-05,500.0

In [27]:
SELECT CUSTOMER_ID,SUM(TOTAL_AMOUNT) FROM ORDERS GROUP BY CUSTOMER_ID;

,CUSTOMER_ID,SUM(TOTAL_AMOUNT)
0,101,700.00
1,102,481.00
2,103,300.75
3,104,120.00
4,105,220.00
5,106,410.00
6,107,275.25
7,108,500.00
8,109,500.00
9,110,600.00

In [29]:
SELECT CUSTOMER_ID, MAX(ORDER_DATE) AS LAST_ORDER_DATE FROM ORDERS GROUP BY CUSTOMER_ID

,CUSTOMER_ID,LAST_ORDER_DATE
0,101,2024-04-05
1,102,2024-07-20
2,103,2024-03-10
3,104,2024-05-25
4,105,2024-06-15
5,106,2024-08-30
6,107,2024-09-10
7,108,2024-10-05
8,109,2024-11-05
9,110,2024-11-19

In [30]:
SELECT CUSTOMER_ID,COUNT(ORDER_ID) AS TOTAL_ORDERS FROM ORDERS GROUP BY CUSTOMER_ID

,CUSTOMER_ID,TOTAL_ORDERS
0,101,2
1,102,2
2,103,1
3,104,1
4,105,1
5,106,1
6,107,1
7,108,1
8,109,1
9,110,1

In [31]:
-- In a Table named Team contains 4 records, we need to schedule a match between each team vs opposite team: -->

CREATE TABLE teams (
    team_id INT PRIMARY KEY,
    team_name VARCHAR(255)
);

INSERT INTO teams (team_id, team_name) VALUES (1, 'India');
INSERT INTO teams (team_id, team_name) VALUES (2, 'Pakistan');
INSERT INTO teams (team_id, team_name) VALUES (3, 'Srilanka');
INSERT INTO teams (team_id, team_name) VALUES (4, 'Australia');

In [10]:
SELECT A.TEAM_NAME AS TEAM, B.TEAM_NAME AS OPP_TEAM FROM TEAMS A, TEAMS B WHERE A.TEAM_ID < B.TEAM_ID

,TEAM,OPP_TEAM
0,India,Pakistan
1,India,Srilanka
2,India,Australia
3,Pakistan,Srilanka
4,Pakistan,Australia
5,Srilanka,Australia

In [ ]:
CREATE TABLE products (
    product_id INT PRIMARY KEY,
    product_name VARCHAR(255),
    price DECIMAL(10, 2),
    product_category VARCHAR(255)
);
INSERT INTO products (product_id, product_name, price, product_category) VALUES (1, 'Laptop', 999.99, 'Electronics');
INSERT INTO products (product_id, product_name, price, product_category) VALUES (2, 'Smartphone', 699.99, 'Electronics');
INSERT INTO products (product_id, product_name, price, product_category) VALUES (3, 'Desk Chair', 149.99, 'Furniture');
INSERT INTO products (product_id, product_name, price, product_category) VALUES (4, 'Coffee Table', 89.99, 'Furniture');
INSERT INTO products (product_id, product_name, price, product_category) VALUES (5, 'Blender', 49.99, 'Kitchen Appliances');
INSERT INTO products (product_id, product_name, price, product_category) VALUES (6, 'Microwave', 129.99, 'Kitchen Appliances');
INSERT INTO products (product_id, product_name, price, product_category) VALUES (7, 'Running Shoes', 79.99, 'Sportswear');
INSERT INTO products (product_id, product_name, price, product_category) VALUES (8, 'Yoga Mat', 29.99, 'Sportswear');
INSERT INTO products (product_id, product_name, price, product_category) VALUES (9, 'Novel', 19.99, 'Books');
INSERT INTO products (product_id, product_name, price, product_category) VALUES (10, 'Cookbook', 24.99, 'Books');

In [ ]:

SQL Questions

 1. Identify the top 5 products that have shown the highest increase in weekly sales over the last quarter.
 2. Calculate the percentage of out-of-stock items for each store and identify the stores that exceed 20% out-of-stock items on average.
 3. Find products that were consistently sold in every store across a region but saw no sales in at least one store last month.
 4. Design a query to track customer retention by calculating how many customers made purchases every month for the last 6 months.
 5. Explain how indexing works in SQL and how you would use it to optimize a query that involves multiple joins on a large dataset of store transactions.
 6. Discuss how you would manage and query a database containing billions of rows of sales data across multiple time zones.
 7. In the case of seasonal promotions, how would you design an SQL query to measure the effectiveness of discounts on specific product categories?
 8. Explain the difference between OLTP and OLAP databases, and provide examples of how Target might use each for its operations.

SQL Questions

 1. Calculate the cancellation rate for each room type over the last 6 months, considering only bookings with a minimum stay of 2 nights.
 2. Determine the average conversion rate (confirmed bookings vs. search events) for users grouped by their country and device type.
 3. Identify properties that have consistently underperformed compared to the average booking rate of their region over the last 12 months.
 4. Detect instances of demand surge where the number of bookings in an hour exceeds the hourly average by more than 50%.
 5. What challenges might arise when querying sharded databases, especially for calculating global metrics like average booking rates?
 6. Explain how you would handle booking timestamps originating from different time zones when querying for global daily booking patterns.
 7. how would you balance normalization for data integrity and denormalization for query performance?
 8. If two systems simultaneously update the same booking record, what mechanisms would you use in SQL to prevent data conflicts and ensure consistency?
 9. Explain the scenarios where window functions outperform traditional group-by clauses in SQL.

    SQL Questions

 1. You are given a table EmployeeLogs with columns EmployeeID, LoginTime, LogoutTime, and Date. Write a query to calculate the longest continuous working streak (consecutive days without missing a login) for each employee.
 2. A table SalesData contains columns TransactionID, Region, ProductID, SaleDate, and Revenue. Write a query to identify the top 3 products with the highest cumulative revenue in each region over the last fiscal year.
 3. Explain the concept of window functions and how they differ from aggregate functions, with examples of use cases.
 4. Describe how ACID properties are maintained in modern relational databases and the challenges associated with distributed systems.
 5. Explain how different types of indexes (e.g., clustered, non-clustered) impact query performance in large datasets.
QL Questions

 1. A table EnergyConsumption contains columns DeviceID, Timestamp, and EnergyUsed. Write a query to find the devices that exceeded their daily average energy usage by more than 20% in the last month.
 2. Given a table Machines with columns MachineID, StartTime, EndTime, and Output, write a query to calculate the total operational time and average output for each machine over the last quarter.
 3. You have a table Suppliers with columns SupplierID, Region, and Rating. Write a query to rank suppliers by their rating within each region.
 4. Explain the differences between OLAP and OLTP databases with examples of use cases for each.
 5. How would you approach optimizing a SQL query that involves multiple joins and subqueries?

Python Questions

 6. Write a Python script to simulate and visualize the operational efficiency of a machine based on given performance metrics over time.
 7. How would you use Python to connect to an SQL database, query data, and save the results as a CSV file?
 8. Write a Python function to calculate the correlation between two columns in a dataset.
 9. Explain how you would use Python libraries such as Pandas and Matplotlib to identify and visualize trends in manufacturing data.
SQL Questions

 1. You have a table Accounts with columns AccountID, CustomerID, Balance, and LastTransactionDate. 
    Write a query to identify accounts that have been inactive for more than 12 months.
 2. Given a table Transactions with columns TransactionID, AccountID, Amount, and TransactionDate, find the top 3 accounts with the highest total transaction volume for each month.
 3. A table LoanApplications contains columns ApplicationID, CustomerID, LoanAmount, ApprovalStatus, and ApplicationDate. Write a query to calculate the average loan amount for approved applications submitted in the last six months.
 4. Explain how a clustered index works and how it differs from a non-clustered index.
 5. Describe a scenario where you would use a self-join in SQL and explain its benefits.
    SQL Questions

 1. You have a table Transactions with columns TransactionID, CustomerID, Date, and Amount. Write a query to calculate the cumulative revenue per customer for each month in the last year.
 2. A table Production contains columns PlantID, Date, and Output. Write a query to identify the plants that consistently exceeded their daily average output for at least 20 days in a given month.
 3. In a table EmployeeAttendance with columns EmployeeID, Date, and Status (values: ‘Present’, ‘Absent’), write a query to find employees with the highest consecutive absences in the last quarter.
 4. What are the pros and cons of using indexes in SQL, and when would you avoid using them?
 5. Explain the differences between window functions and aggregate functions with examples.
Python Questions

 6. Write a Python script to process a JSON file containing customer data and convert it into a structured DataFrame.
 7. Develop a function to calculate the moving average of a given numerical column in a dataset.
 8. Explain how you would use Python to validate and clean data received from an external source (e.g., removing duplicates, handling null values, etc.).
 9. Write a Python program to identify and report outliers in a numerical dataset using the interquartile range (IQR) method.
Python Questions

 6. Write a Python program to calculate the cosine similarity between two large datasets represented as sparse vectors stored in a database.
 7. You have a multi-gigabyte CSV file that doesn’t fit into memory. Write a Python script to calculate the average value of a specific column without loading the entire file into memory.
 8. Implement a Python class that dynamically creates a hierarchical data structure from a flat table with ID, ParentID, and Value columns.
Python Questions

 1. Write a function to calculate the total sales of a product, given a list of daily sales data.
 2. Develop a script that reads a dictionary containing product IDs and their stock counts, and flags products that have stock below a certain threshold.
 3. Write a Python function to generate a weekly sales report from a CSV file containing transaction data (columns: date, product_id, sales_amount). The output should be the total sales for each product for the week.
 4. Explain how Python’s pandas library can be used to handle missing data in large sales datasets. Provide an example of filling in missing values for daily sales based on the average sales of the corresponding day of the week.
 5. Write a function that takes two lists: one with store IDs and another with their corresponding revenue. Return a dictionary where the keys are store IDs, and the values are the revenues.
 6. What are the key differences between a list and a dictionary in Python? How would you use them for different tasks in analyzing retail data?

In [ ]:
SQL Questions:

1. Retrieve Housing Data from Specific Cities

You’re a data analyst at Airbnb and you’ve been tasked with retrieving housing data from specific cities.
    You want to find all Airbnb listings in San Francisco and New York that have at least 10 reviews and an average rating equal to or above 4.5.

Tables:
 • listings: listing_id (integer), name (string), city (string), reviews_count (integer)
 • reviews: listing_id (integer), review_id (integer), stars (integer), submit_date (date)

2. Find the Average Number of Guests per Booking in Each City for Airbnb

As an analyst at Airbnb, one of the most useful insights you could provide would be to understand the average number of guests per booking across locations. For this question, we would like you to write a SQL query that will find the average number of guests per booking in each city.

Tables:
 • bookings: booking_id (integer), property_id (integer), guests (integer), booking_date (date)
 • properties: property_id (integer), city (string)

3. Analyzing Click-Through Rates for Airbnb Listing Views and Bookings

The scenario is that Airbnb wants to analyze the click-through conversion rates (CTRs) of their listings. The CTR is calculated by dividing the number of bookings by the number of listing views, giving a proportion of views that resulted in a booking.

Tables:
 • listing_views: view_id (integer), user_id (integer), visit_date (date), listing_id (integer)
 • bookings: booking_id (integer), user_id (integer), booking_date (date), listing_id (integer)

4. Average Vacant Days in 2021 for Active Listings

The strategy team in Airbnb is trying to analyze the impact of Covid-19 during 2021. To do so, they need you to write a query that outputs the average vacant days across the AirBnbs in 2021. Some properties have gone out of business, so you should only analyze rentals that are currently active. Round the results to a whole number.

Assumptions:
 • is_active field equals 1 when the property is active, and 0 otherwise.
 • In cases where the check-in or check-out date is in another year other than 2021, limit the calculation to the beginning or end of the year 2021 respectively.
 • A listing can be active even if there are no bookings throughout the year.

Tables:
 • bookings: listing_id (integer), checkin_date (date), checkout_date (date)
 • listings: listing_id (integer), is_active (integer)

3️⃣ SQL Question 3: What does EXCEPT / MINUS SQL commands do?

Question: Explain the purpose and usage of the EXCEPT (or MINUS in some SQL dialects) SQL commands.

4️⃣ SQL Question 4: Filter Netflix Users Based on Viewing History and Subscription Status

Question: You are given a database of Netflix’s user viewing history and their current subscription status. Write a SQL query to find all active customers who watched more than 10 episodes of a show called “Stranger Things” in the last 30 days.

Tables:
• users table: user_id (integer), active (boolean)
• viewing_history table: user_id (integer), show_id (integer), episode_id (integer), watch_date (date)
• shows table: show_id (integer), show_name (text)

5️⃣ SQL Question 5: What does it mean to denormalize a database?

Question: Explain the concept and implications of denormalizing a database.

6️⃣ SQL Question 6: Filter and Match Customer’s Viewing Records

Question: As a data analyst at Netflix, you are asked to analyze the customer’s viewing records. You confirmed that Netflix is especially interested in customers who have been continuously watching a particular genre - ‘Documentary’ over the last month. The task is to find the name and email of those customers who have viewed more than five ‘Documentary’ movies within the last month. ‘Documentary’ could be a part of a broader genre category in the genre field (for example, ‘Documentary, History’). Therefore, the matching pattern could occur anywhere within the string.

Tables:
• movies table: movie_id (integer), title (text), genre (text), release_year (integer)
• customer table: user_id (integer), name (text), email (text), last_movie_watched (integer), date_watched (date)



1️⃣ SQL Question 1: Identify VIP Users for Netflix

Question: To better cater to its most dedicated users, Netflix would like to identify its “VIP users” - those who are most active in terms of the number of hours of content they watch. Write a SQL query that will retrieve the top 10 users with the most watched hours in the last month.

Tables:
• users table: user_id (integer), sign_up_date (date), subscription_type (text)
• watching_activity table: activity_id (integer), user_id (integer), date_time (timestamp), show_id (integer), hours_watched (float)

2️⃣ SQL Question 2: Analyzing Ratings For Netflix Shows

Question: Given a table of user ratings for Netflix shows, calculate the average rating for each show within a given month. Assume that there is a column for user_id, show_id, rating (out of 5 stars), and date of review. Order the results by month and then by average rating (descending order).

Tables:
• show_reviews table: review_id (integer), user_id (integer), review_date (timestamp), show_id (integer), stars (integer)

Microsoft
1️⃣ Most Popular Client ID:
Select the most popular client_id based on a count of the number of users who have at least 50% of their events 
    from the following list: ‘video call received’, ‘video call sent’, ‘voice call received’, ‘voice call sent’.

2️⃣ Desktop-Only Users:
Write a query that returns the company (customer_id column) with the highest number of users that use desktop only.

3️⃣ Bottom Companies by Mobile Usage:
Write a query that returns a list of the bottom 2 companies by mobile usage. 
    Company is defined in the customer_id column. Mobile usage is defined as the number of events registered on a client_id == 'mobile'. Order the result by the number of events ascending. In the case where there are multiple companies tied for the bottom ranks (rank 1 or 2), return all the companies. Output the customer_id and number of events.

4️⃣ Exclusive Users per Client:
Write a query that returns a number of users who are exclusive to only one client. Output the client_id and number of exclusive users.

5️⃣ Unique Users per Client per Month:
Write a query that returns the number of unique users per client per month.

6️⃣ Monthly User Share (New vs. Existing):
Calculate the share of new and existing users for each month in the table. Output the month, share of new users, and share of existing users as a ratio. New users are defined as users who started using services in the current month (there is no usage history in previous months). Existing users are users who used services in the current month but also used services in any previous month. Assume that the dates are all from the year 2020.

Table Structure 
 • id: int64
 • time_id: datetime64[ns]
 • user_id: object
 • customer_id: object
 • client_id: object
 • event_type: object
 • event_id: int64

In [ ]:
SQL Questions:

 1. Write a query to find the cumulative revenue by month for each product category in a sales table.
 2. How would you retrieve the top 5 products by sales volume, excluding any products that had zero sales in the past 3 months?
 3. Given a table of customer transactions, identify all customers who made purchases in two or more consecutive months.
 4. Write a query to calculate the retention rate of users on a monthly basis.
 5. Find the nth highest salary from an employee table, where n is a parameter passed dynamically to the query.
 6. Explain how indexing works in SQL and how to decide which columns should be indexed for optimal performance.
 7. Describe the differences between LEFT JOIN, RIGHT JOIN, and FULL OUTER JOIN and when to use each one in a complex query.
 8. What is the difference between HAVING and WHERE clauses in SQL, and when would you use each?

Python Questions:

 1. Write a Python function to find all unique pairs of integers in a list that sum up to a given target value.
 2. Given a string, write a function to check if it’s a palindrome, ignoring spaces, punctuation, and case sensitivity.
 3. Explain the difference between deep copy and shallow copy in Python. When would you use each?
 4. What are decorators in Python, and how do they work? Provide an example of a scenario where a decorator would be useful.

In [ ]:
1- Reversing a String using an Extended Slicing techniques.

2- Count Vowels from Given words.

3- Find the highest occurrences of each word from string and sort them in order.

4- Remove Duplicates from List.

5-Sort a List without using Sort keyword.

6-Find the pair of numbers in this list whose sum is n no.

7-Find the max and min no in the list without using inbuilt functions.

8-Calculate the Intersection of Two Lists without using Built-in Functions

9-Write Python code to make API requests to a public API (e.g., weather API) and process the JSON response.

10-Implement a function to fetch data from a database

table, perform data manipulation, and update the

database.

11-Write Python code to read from a file and count the number of lines, words, and characters.

12-Write Python code to read a CSV file into a DataFrame, perform some data manipulation (like filtering and aggregating), and save the result back to a new CSV file.